import type { ColorType } from '../../types';

const blue: ColorType = {
  50: '#e8f0fa', // Очень светлый синий
  100: '#b6c9e5', // Светлый синий
  200: '#8ba8d6', // Чуть светлее обычного синего
  300: '#5c7bb3', // Базовый синий
  400: '#39548c', // Более насыщенный синий
  500: '#223a6d', // Тёмно-синий (основной)
  600: '#1C3140', // Ещё темнее
  700: '#101c33', // Очень тёмный синий
  800: '#0A141F', // Почти чёрный синий
  900: '#050a13', // Максимально тёмный синий
  A100: '#6b8fd6', // Акцентный светлый синий
  A200: '#39548c', // Акцентный насыщенный синий
  A400: '#223a6d', // Акцентный тёмно-синий
  A700: '#101C26', // Акцентный максимально тёмный синий
};

export default blue;
