import type { ColorType } from '../../types';

const dark: ColorType = {
  50: '#23272b', // Очень светлый тёмный
  100: '#1a1d20', // Светлый тёмный
  200: '#16191c', // Чуть светлее базового чёрного
  300: '#121417', // Базовый тёмный
  400: '#0e1012', // Ещё темнее
  500: '#0a0b0d', // Почти чёрный
  600: '#08090a', // Очень тёмный
  700: '#06090E', // Почти абсолютный чёрный
  800: '#040405', // Ещё темнее
  900: '#000000', // Чёрный
  A100: '#23272b', // Акцентный светлый тёмный
  A200: '#16191c', // Акцентный тёмный
  A400: '#0e1012', // Акцентный глубокий тёмный
  A700: '#060708', // Акцентный почти чёрный
};

export default dark;
